app/controllers/suppliers_controller.rb

INSERT INTO "suppliers" ("name", "lastname", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Cristiano"], ["lastname", "Ronaldo"], ["created_at", "2016-08-25 02:37:53.920365"], ["updated_at", "2016-08-25 02:37:53.920365"]]
---
  def create
    @supplier = Supplier.new(supplier_params)

    respond_to do |format|
      if @supplier.save

SELECT  "suppliers".* FROM "suppliers" WHERE "suppliers"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_supplier
      @supplier = Supplier.find(params[:id])