app/controllers/users_controller.rb

INSERT INTO "users" ("name", "lastname", "cod_user", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Miguel"], ["lastname", "Samudio"], ["cod_user", 1234], ["created_at", "2016-08-24 22:20:28.579640"], ["updated_at", "2016-08-24 22:20:28.579640"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save